read_lef -lef /ef/home/rs/proton/TESTS/library/NangateOpenCellLibrary_PDKv1_2_v2008_10.lef  -tech also

read_verilog -v /ef/home/rs/proton/TESTS/netlists/fifo.vg
elaborate
