read_lef -lef /home/ubuntu/proton/TESTS/library/NangateOpenCellLibrary_PDKv1_2_v2008_10.lef  -tech also

read_verilog -v /home/ubuntu/proton/TESTS/netlists/fifo.vg
elaborate
